Revit 2026 API

# SubelementElement Property

---

The element in which the subelement resides.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Element Element { get; }
```
```vb
Public ReadOnly Property Element As Element
	Get
```
```cpp
public:
property Element^ Element {
	Element^ get ();
}
```
```fsharp
member Element : Element with get
```

#### Property Value

Element

If subelement refers to whole element, this element is returned.

#### Reference

Subelement Class

Autodesk.Revit.DB Namespace